RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal_pwr_ex.c
  /* Enable the USB voltage detector */
  SET_BIT(PWR->CSR2, PWR_CSR2_USB33DEN);

  /* Get tick */
  tickstart = HAL_GetTick();

  /* Wait till the USB regulator ready flag is set */
  while ((PWR->CSR2 & PWR_CSR2_USB33RDY) == 0U)
  {
    if ((HAL_GetTick() - tickstart) > PWR_FLAG_SETTING_DELAY)
    {
      return HAL_ERROR;
    }
  }
  return HAL_OK;
}

/**
  * @brief Disable the USB voltage level detector.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_PWREx_DisableUSBVoltageDetector(void)
{
  uint32_t tickstart;

  /* Disable the USB voltage detector */
  CLEAR_BIT(PWR->CSR2, PWR_CSR2_USB33DEN);

  /* Get tick */
  tickstart = HAL_GetTick();

  /* Wait till the USB regulator ready flag is reset */
  while ((PWR->CSR2 & PWR_CSR2_USB33RDY) != 0U)
  {
    if ((HAL_GetTick() - tickstart) > PWR_FLAG_SETTING_DELAY)
    {
      return HAL_ERROR;
    }
  }

  return HAL_OK;
}

/**
  * @brief Enable the USB HS regulator.
  * @retval None.
  */
void HAL_PWREx_EnableUSBHSregulator(void)
{
  /* Enable the USB HS regulator */
  SET_BIT(PWR->CSR2, PWR_CSR2_USBHSREGEN);
}

/**
  * @brief Disable the USB HS regulator.
  * @retval None.
  */
void HAL_PWREx_DisableUSBHSregulator(void)
{
  /* Disable the USB HS regulator */
  CLEAR_BIT(PWR->CSR2, PWR_CSR2_USBHSREGEN);
}

/**
  * @brief Enable UCPD configuration memorization in Standby.
  * @retval None
  * @note  This function must be called just before entering Standby mode when using UCPD.
  */
void HAL_PWREx_EnableUCPDStandbyMode(void)
{
  /* Memorize UCPD configuration when entering standby mode */
  SET_BIT(PWR->UCPDR, PWR_UCPDR_UCPD_STBY);
}

/**
  * @brief Disable UCPD configuration memorization in Standby.
  * @note  This function must be called on exiting the Standby mode and before any UCPD
  *        configuration update.
  * @retval None
  */
void HAL_PWREx_DisableUCPDStandbyMode(void)
{
  CLEAR_BIT(PWR->UCPDR, PWR_UCPDR_UCPD_STBY);
}

/**
  * @brief Enable dead battery behavior.
  * @retval None
  */
void HAL_PWREx_EnableUCPDDeadBattery(void)
{
  /* Enable dead battery behavior */
  CLEAR_BIT(PWR->UCPDR, PWR_UCPDR_UCPD_DBDIS);
}

/**
  * @brief Disable dead battery behavior.
  * @retval None
  */
void HAL_PWREx_DisableUCPDDeadBattery(void)
{
  /* Disable dead battery behavior */
  SET_BIT(PWR->UCPDR, PWR_UCPDR_UCPD_DBDIS);
}

/**
  * @brief Enable the Battery charging.
  * @note   When VDD is present, charge the external battery through an internal
  *         resistor.
  *         It is automatically disabled in VBAT mode.
  * @param  ResistorValue : Specifies the charging resistor.
  *          This parameter can be one of the following values :
  *            @arg PWR_BATTERY_CHARGING_RESISTOR_5   : 5 KOhm resistor.
  *            @arg PWR_BATTERY_CHARGING_RESISTOR_1_5 : 1.5 KOhm resistor.
  * @retval None.
  */
void HAL_PWREx_EnableBatteryCharging(uint32_t ResistorValue)
{
  /* Check the parameter */
  assert_param(IS_PWR_BATTERY_RESISTOR_SELECT(ResistorValue));

  /* Specify the charging resistor and enable the Battery charging */
  MODIFY_REG(PWR->CSR2, (PWR_CSR2_VBRS | PWR_CSR2_VBE), (ResistorValue | PWR_CSR2_VBE));

}

/**
  * @brief Disable the Battery charging.
  * @retval None.
  */
void HAL_PWREx_DisableBatteryCharging(void)
{
  /* Disable the Battery charging and restore default charging resistor value */
  CLEAR_BIT(PWR->CSR2, (PWR_CSR2_VBE | PWR_CSR2_VBRS));
}

/**
  * @brief Enable the booster to guarantee the analog switch AC performance when
  *        the VDD supply voltage is below 2V7.
  * @note   The VDD supply voltage can be monitored through the PVD and the PLS
  *         field bits.
  * @retval None.
  */
void HAL_PWREx_EnableAnalogBooster(void)
{
  /* Enable the Analog voltage */
  SET_BIT(PWR->CR1, PWR_CR1_AVDREADY);

  /* Enable VDDA booster */
  SET_BIT(PWR->CR1, PWR_CR1_BOOSTE);
}

/**
  * @brief Disable the analog booster.
  * @retval None.
  */
void HAL_PWREx_DisableAnalogBooster(void)
{
  /* Disable VDDA booster */
  CLEAR_BIT(PWR->CR1, PWR_CR1_BOOSTE);

  /* Disable the Analog voltage */
  CLEAR_BIT(PWR->CR1, PWR_CR1_AVDREADY);
}

/**
  * @brief  Enable the XSPIM_P1 interface.
  * @note   The XSPIM_P1 supply must be stable prior to setting
            this bit.
  * @retval None.
  */
void HAL_PWREx_EnableXSPIM1(void)
{
  SET_BIT(PWR->CSR2, PWR_CSR2_EN_XSPIM1);
}

/**
  * @brief Disable the XSPIM_P1 interface.
  * @retval None.
  */
void HAL_PWREx_DisableXSPIM1(void)
{
  CLEAR_BIT(PWR->CSR2, PWR_CSR2_EN_XSPIM1);
}

/**
  * @brief  Enable the XSPIM_P2 interface.
  * @note   The XSPIM_P2 supply must be stable prior to setting
            this bit.
  * @retval None.
  */
void HAL_PWREx_EnableXSPIM2(void)
{
  SET_BIT(PWR->CSR2, PWR_CSR2_EN_XSPIM2);
}

/**
  * @brief Disable the XSPIM_P2 interface.
  * @retval None.
  */
void HAL_PWREx_DisableXSPIM2(void)
{
  CLEAR_BIT(PWR->CSR2, PWR_CSR2_EN_XSPIM2);
}

/**
  * @brief  Configure the capacitor port
  * @param  PortCapacitor Select the Port
  *         This parameter can be one of the following values:
  *           @arg @ref PWR_CAPACITOR_PORT1    XSPI port 1 capacitor
  *           @arg @ref PWR_CAPACITOR_PORT2    XSPI port 2 capacitor
  * @param  PortCapacitorSetting Select the capacitor setting
  *         This parameter can be one of the following values:
  *           @arg @ref PWR_CAPACITOR_OFF                     XSPI Capacitor OFF
  *           @arg @ref PWR_CAPACITOR_ONE_THIRD_CAPACITANCE   XSPI Capacitor set to 1/3
  *           @arg @ref PWR_CAPACITOR_TWO_THIRD_CAPACITANCE   XSPI Capacitor set to 2/3
  *           @arg @ref PWR_CAPACITOR_FULL_CAPACITANCE        XSPI Capacitor set to full capacitance
  * @retval None.
  */
void HAL_PWREx_ConfigXSPIPortCap(uint32_t PortCapacitor, uint32_t PortCapacitorSetting)
{
  /* Check the parameters */
  assert_param(IS_PWR_CAPACITOR(PortCapacitor));
  assert_param(IS_PWR_CAPACITOR_SETTING(PortCapacitorSetting));

  if (PortCapacitor == PWR_CAPACITOR_PORT1)
  {
    /* Set Port1 Capacitor setting */
    MODIFY_REG(PWR->CSR2, PWR_CSR2_XSPICAP1, PortCapacitorSetting);
  }
  else
  {
    /* Set Port2 Capacitor setting */
    MODIFY_REG(PWR->CSR2, PWR_CSR2_XSPICAP2, PortCapacitorSetting << (PWR_CSR2_XSPICAP2_Pos - PWR_CSR2_XSPICAP1_Pos));
  }
}

/**
  * @brief  Get the capacitor port setting
  * @param  PortCapacitor Select the Port
  *         This parameter can be one of the following values:
  *           @arg @ref PWR_CAPACITOR_PORT1    XSPI port 1 capacitor
  *           @arg @ref PWR_CAPACITOR_PORT2    XSPI port 2 capacitor
  * @retval The capacitor setting:
  *           @arg @ref PWR_CAPACITOR_OFF                     XSPI Capacitor OFF
  *           @arg @ref PWR_CAPACITOR_ONE_THIRD_CAPACITANCE   XSPI Capacitor set to 1/3
  *           @arg @ref PWR_CAPACITOR_TWO_THIRD_CAPACITANCE   XSPI Capacitor set to 2/3
  *           @arg @ref PWR_CAPACITOR_FULL_CAPACITANCE        XSPI Capacitor set to full capacitance
  */
uint32_t HAL_PWREx_GetConfigXSPIPortCap(uint32_t PortCapacitor)
{
  uint32_t PortCapacitorSetting;

  /* Check the parameter */
  assert_param(IS_PWR_CAPACITOR(PortCapacitor));

