RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal_pwr_ex.c
  return status;
}

/**
  * @brief Enable GPIO pull-down state in Standby mode.
  * @note  Set the relevant PDy bits of PWR_PDCRx register to configure the I/O in
  *        pull-down state in Standby mode.
  * @note  This state is effective in Standby mode only if APC bit
  *        is set through HAL_PWREx_EnablePullUpPullDownConfig() API.
  * @note  The configuration is maintained when exiting the Standby mode.
  * @note  Even if a PDy bit to set is reserved, the other PDy bits entered as input
  *        parameter at the same time are set.
  * @param  GPIO_Port : Specify the IO port.
  *                     This parameter can be a value of @ref PWREx_GPIO_PullDown_Port.
  * @param  GPIO_Pin  : Specify the I/O pins numbers.
  *                     This parameter can be a combination of @ref PWREx_GPIO_PullDown_Pin_Mask.
  * @retval HAL Status
  */
HAL_StatusTypeDef HAL_PWREx_EnableGPIOPullDown(uint32_t GPIO_Port, uint32_t GPIO_Pin)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check the parameters */
  assert_param(IS_PWR_GPIO_PULLDOWN_PORT(GPIO_Port));
  assert_param(IS_PWR_GPIO_PIN_MASK(GPIO_Pin));

  switch (GPIO_Port)
  {
    case PWR_GPIO_PULLDOWN_PORT_N:
      SET_BIT(PWR->PDCRN, GPIO_Pin);
      break;

    case PWR_GPIO_PULLDOWN_PORT_O:
      SET_BIT(PWR->PDCRO, GPIO_Pin);
      break;

    case PWR_GPIO_PULLDOWN_PORT_P:
      SET_BIT(PWR->PDCRP, GPIO_Pin);
      break;

    default:
      status = HAL_ERROR;
      break;
  }

  return status;
}

/**
  * @brief Disable GPIO pull-down state in Standby mode.
  * @note  Reset the relevant PDy bits of PWR_PDCRx register used to configure the I/O
  *        in pull-down state in Standby mode.
  * @note  Even if a PDy bit to reset is reserved, the other PDy bits entered as input
  *        parameter at the same time are reset.
  * @param  GPIO_Port : Specify the IO port.
  *                     This parameter can be a value of @ref PWREx_GPIO_PullDown_Port.
  * @param  GPIO_Pin  : Specify the I/O pins numbers.
  *                     This parameter can be a value of @ref PWREx_GPIO_PullDown_Pin_Mask.
  * @retval HAL Status
  */
HAL_StatusTypeDef HAL_PWREx_DisableGPIOPullDown(uint32_t GPIO_Port, uint32_t GPIO_Pin)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check the parameters */
  assert_param(IS_PWR_GPIO_PULLDOWN_PORT(GPIO_Port));
  assert_param(IS_PWR_GPIO_PIN_MASK(GPIO_Pin));

  switch (GPIO_Port)
  {
    case PWR_GPIO_PULLDOWN_PORT_N:
      CLEAR_BIT(PWR->PDCRN, GPIO_Pin);
      break;

    case PWR_GPIO_PULLDOWN_PORT_O:
      CLEAR_BIT(PWR->PDCRO, GPIO_Pin);
      break;

    case PWR_GPIO_PULLDOWN_PORT_P:
      CLEAR_BIT(PWR->PDCRP, GPIO_Pin);
      break;

    default:
      status = HAL_ERROR;
      break;
  }

  return status;
}
/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_PWR_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */

